<!-- terraform-plan-aws:prod -->
## 🟨 Terraform plan (aws/prod) — Changes detected
**Changes:** +9 ~2 -1
**Time:**
| TZ | Time |
| --- | --- |
| UTC | 2026-03-12, 12:52:27 a.m. |
| NZ | 2026-03-12, 1:52:27 p.m. |
| PT | 2026-03-11, 5:52:27 p.m. |
| ET | 2026-03-11, 8:52:27 p.m. |

Run: https://github.com/JesusFilm/forge/actions/runs/22981609727

```
module.platform.module.application.ephemeral.random_password.dev_transfer_token_salt: Opening...
module.platform.module.application.ephemeral.random_password.dev_admin_jwt_secret: Opening...
module.platform.module.application.ephemeral.random_password.dev_app_key_3: Opening...
module.platform.module.application.ephemeral.random_password.dev_encryption_key: Opening...
module.platform.module.application.ephemeral.random_password.dev_jwt_secret: Opening...
module.platform.module.application.ephemeral.random_password.transfer_token_salt: Opening...
module.platform.module.application.ephemeral.random_password.strapi_internal_api_token: Opening...
module.platform.module.application.ephemeral.random_password.app_key_4: Opening...
module.platform.module.application.ephemeral.random_password.dev_jwt_secret: Opening complete after 0s
module.platform.module.application.ephemeral.random_password.dev_transfer_token_salt: Opening complete after 0s
module.platform.module.application.ephemeral.random_password.dev_encryption_key: Opening complete after 0s
module.platform.module.application.ephemeral.random_password.dev_app_key_3: Opening complete after 0s
module.platform.module.application.ephemeral.random_password.app_key_2: Opening...
module.platform.module.application.ephemeral.random_password.encryption_key: Opening...
module.platform.module.application.ephemeral.random_password.strapi_internal_api_token: Opening complete after 0s
module.platform.module.application.ephemeral.random_password.dev_app_key_4: Opening...
module.platform.module.application.ephemeral.random_password.app_key_4: Opening complete after 0s
module.platform.module.application.ephemeral.random_password.jwt_secret: Opening...
module.platform.module.application.ephemeral.random_password.transfer_token_salt: Opening complete after 0s
module.platform.module.application.ephemeral.random_password.dev_app_key_1: Opening...
module.platform.module.application.ephemeral.random_password.api_token_salt: Opening...
module.platform.module.application.ephemeral.random_password.dev_api_token_salt: Opening...
module.platform.module.application.ephemeral.random_password.dev_admin_jwt_secret: Opening complete after 0s
module.platform.module.application.ephemeral.random_password.app_key_3: Opening...
module.platform.module.application.ephemeral.random_password.jwt_secret: Opening complete after 0s
module.platform.module.application.ephemeral.random_password.encryption_key: Opening complete after 0s
module.platform.module.application.ephemeral.random_password.app_key_2: Opening complete after 0s
module.platform.module.application.ephemeral.random_password.app_key_1: Opening...
module.platform.module.application.ephemeral.random_password.dev_app_key_4: Opening complete after 0s
module.platform.module.application.ephemeral.random_password.api_token_salt: Opening complete after 0s
module.platform.module.application.ephemeral.random_password.dev_app_key_2: Opening...
module.platform.module.assets.aws_acm_certificate.assets: Refreshing state... [id=arn:aws:acm:us-east-1:031374266475:certificate/ab733e08-7e38-4631-9576-ee73d0afee13]
module.platform.module.application.ephemeral.random_password.admin_jwt_secret: Opening...
module.platform.module.application.ephemeral.random_password.dev_app_key_1: Opening complete after 0s
module.platform.module.application.ephemeral.random_password.dev_api_token_salt: Opening complete after 0s
module.platform.module.application.ephemeral.random_password.app_key_3: Opening complete after 0s
module.platform.module.application.ephemeral.random_password.app_key_1: Opening complete after 0s
module.platform.module.application.ephemeral.random_password.dev_app_key_2: Opening complete after 0s
module.platform.module.application.ephemeral.random_password.admin_jwt_secret: Opening complete after 0s
data.aws_caller_identity.current: Reading...
aws_route53_zone.forge[0]: Refreshing state... [id=Z078031724OHPW03IKVLO]
module.github.data.aws_kms_alias.cms_ssm_stage[0]: Reading...
module.platform.module.application.aws_cloudwatch_log_group.cms: Refreshing state... [id=/ecs/forge-cms-prod]
module.github.data.aws_kms_alias.cms_ssm_prod[0]: Reading...
module.github.aws_ssm_parameter.github_installation_id[0]: Refreshing state... [id=/forge/github/installation_id]
module.iam[0].module.groups.module.login_profile.aws_iam_group.login_profile: Refreshing state... [id=forge-iam-login-profile]
module.platform.module.assets.aws_s3_bucket.assets: Refreshing state... [id=forge-cms-prod-assets]
module.platform.aws_s3_bucket.alb_logs: Refreshing state... [id=forge-platform-prod-alb-logs]
data.aws_caller_identity.current: Read complete after 0s [id=031374266475]
module.vercel.aws_kms_key.vercel_ssm[0]: Refreshing state... [id=37e33c00-2088-4cb5-85a4-7136e2b364b1]
module.github.data.aws_kms_alias.cms_ssm_stage[0]: Read complete after 1s [id=arn:aws:kms:us-east-2:031374266475:alias/forge-cms-stage-ssm]
module.iam[0].module.groups.module.billing.aws_iam_group.billing: Refreshing state... [id=forge-billing]
module.platform.module.application.aws_ecr_repository.cms: Refreshing state... [id=forge-cms-prod]
module.github.data.aws_kms_alias.cms_ssm_prod[0]: Read complete after 1s [id=arn:aws:kms:us-east-2:031374266475:alias/forge-cms-prod-ssm]
module.github.aws_iam_openid_connect_provider.github_actions: Refreshing state... [id=arn:aws:iam::031374266475:oidc-provider/token.actions.githubusercontent.com]
module.github.aws_kms_key.github_ssm[0]: Refreshing state... [id=b3aebd98-e778-445f-8e66-f23b48dae25c]
data.aws_dynamodb_table.terraform_state_lock: Reading...
module.platform.module.application.aws_acm_certificate.alb: Refreshing state... [id=arn:aws:acm:us-east-2:031374266475:certificate/63f93430-798e-4379-b0b5-d65255199a29]
module.github.aws_ssm_parameter.github_app_id[0]: Refreshing state... [id=/forge/github/app_id]
module.platform.module.assets.aws_kms_key.assets: Refreshing state... [id=52863204-2209-4678-9c47-151c5cdf08d6]
module.iam[0].module.groups.module.dev_secrets.aws_iam_group.dev_secrets: Refreshing state... [id=forge-dev-secrets]
module.github.data.aws_caller_identity.current: Reading...
module.platform.aws_vpc.platform: Refreshing state... [id=vpc-05ef5d31814417688]
module.github.data.aws_caller_identity.current: Read complete after 0s [id=031374266475]
module.github.data.aws_kms_alias.terraform_state: Reading...
module.iam[0].module.groups.module.billing.data.aws_iam_policy_document.billing: Reading...
module.iam[0].module.groups.module.billing.data.aws_iam_policy_document.billing: Read complete after 0s [id=3512268210]
module.platform.data.aws_availability_zones.available: Reading...
module.platform.data.aws_caller_identity.current: Reading...
module.iam[0].module.groups.module.dev_secrets.data.aws_caller_identity.current: Reading...
module.github.data.aws_kms_alias.terraform_state: Read complete after 0s [id=arn:aws:kms:us-east-2:031374266475:alias/forge-terraform-state]
module.platform.data.aws_caller_identity.current: Read complete after 0s [id=031374266475]
module.iam[0].module.groups.module.require_mfa.data.aws_caller_identity.current: Reading...
module.iam[0].module.groups.module.dev_secrets.data.aws_caller_identity.current: Read complete after 0s [id=031374266475]
module.github.data.aws_iam_policy_document.github_actions_terraform_apply: Reading...
module.github.data.aws_iam_policy_document.github_actions_terraform_apply: Read complete after 0s [id=93546883]
module.iam[0].module.groups.module.login_profile.data.aws_caller_identity.current: Reading...
data.aws_dynamodb_table.terraform_state_lock: Read complete after 0s [id=forge-terraform-locks]
module.platform.module.assets.data.aws_caller_identity.current: Reading...
module.iam[0].module.groups.module.require_mfa.data.aws_caller_identity.current: Read complete after 0s [id=031374266475]
module.platform.module.assets.aws_cloudfront_origin_access_control.assets: Refreshing state... [id=E1TD5D8QKH7E2K]
module.platform.data.aws_availability_zones.available: Read complete after 0s [id=us-east-2]
module.platform.module.application.aws_ecs_cluster.cms: Refreshing state... [id=arn:aws:ecs:us-east-2:031374266475:cluster/forge-cms-prod]
module.iam[0].module.groups.module.login_profile.data.aws_caller_identity.current: Read complete after 0s [id=031374266475]
module.platform.module.assets.aws_s3_bucket.assets_access_logs: Refreshing state... [id=forge-cms-prod-assets-access-logs]
module.platform.module.assets.data.aws_caller_identity.current: Read complete after 0s [id=031374266475]
module.iam[0].module.groups.module.admin_readonly.aws_iam_group.admin_readonly: Refreshing state... [id=forge-admin-readonly]
module.platform.module.application.aws_iam_role.ecs_execution: Refreshing state... [id=forge-cms-prod-execution-role]
module.platform.module.application.aws_iam_role.ecs_task: Refreshing state... [id=forge-cms-prod-task-role]
module.platform.aws_eip.nat: Refreshing state... [id=eipalloc-0bfddde8d0da76aa6]
module.platform.module.application.aws_kms_key.cms_ssm: Refreshing state... [id=ce229066-4018-4d88-8843-4aa9d08e7e47]
module.platform.aws_cloudwatch_log_group.waf: Refreshing state... [id=aws-waf-logs-forge-platform-prod]
data.aws_s3_bucket.terraform_state: Reading...
module.github.data.aws_kms_key.cms_ssm_stage[0]: Reading...
module.github.data.aws_kms_key.cms_ssm_prod[0]: Reading...
module.vercel.aws_ssm_parameter.api_token[0]: Refreshing state... [id=/forge/vercel/api_token]
module.github.data.aws_kms_key.cms_ssm_stage[0]: Read complete after 0s [id=5936d262-64d2-447d-8c57-2c8536b7c793]
module.vercel.aws_kms_alias.vercel_ssm[0]: Refreshing state... [id=alias/forge-vercel-prod-ssm]
module.platform.aws_wafv2_web_acl.alb: Refreshing state... [id=5d527a2d-be37-446e-b4ed-53dd11c94e8a]
module.github.data.aws_kms_key.cms_ssm_prod[0]: Read complete after 0s [id=ce229066-4018-4d88-8843-4aa9d08e7e47]
module.github.data.aws_iam_policy_document.github_actions_assume_role: Reading...
module.github.data.aws_iam_policy_document.github_actions_assume_role: Read complete after 0s [id=4244198687]
module.github.data.aws_iam_policy_document.github_actions_terraform_plan_assume_role: Reading...
module.github.data.aws_iam_policy_document.github_actions_terraform_plan_assume_role: Read complete after 0s [id=1657400500]
module.github.data.aws_iam_policy_document.github_actions_terraform_apply_assume_role: Reading...
module.github.data.aws_iam_policy_document.github_actions_terraform_apply_assume_role: Read complete after 0s [id=3016267585]
module.github.aws_ssm_parameter.github_app_pem[0]: Refreshing state... [id=/forge/github/app_private_key]
module.github.aws_kms_alias.github_ssm[0]: Refreshing state... [id=alias/forge-github-prod-ssm]
module.github.data.aws_iam_policy_document.github_actions_cms_deploy: Reading...
module.github.data.aws_iam_policy_document.github_actions_cms_deploy: Read complete after 0s [id=3621128515]
module.iam[0].module.groups.module.billing.aws_iam_group_policy.billing: Refreshing state... [id=forge-billing:forge-billing]
module.platform.module.assets.aws_kms_alias.assets: Refreshing state... [id=alias/forge-cms-prod-assets]
module.github.data.aws_kms_key.terraform_state: Reading...
module.iam[0].module.groups.module.dev_secrets.data.aws_iam_policy_document.dev_secrets: Reading...
data.aws_s3_bucket.terraform_state: Read complete after 0s [id=forge-terraform-state-031374266475]
module.iam[0].module.groups.module.dev_secrets.data.aws_iam_policy_document.dev_secrets: Read complete after 0s [id=532461748]
module.github.data.aws_kms_key.terraform_state: Read complete after 0s [id=68220f21-2ca1-4846-9c2a-c8b6e268e63c]
module.github.aws_iam_policy.github_actions_terraform_apply[0]: Refreshing state... [id=arn:aws:iam::031374266475:policy/forge-github-actions-terraform-apply]
module.iam[0].module.groups.module.require_mfa.data.aws_iam_policy_document.require_mfa: Reading...
module.iam[0].module.groups.module.login_profile.data.aws_iam_policy_document.login_profile: Reading...
module.iam[0].module.groups.module.admin_readonly.aws_iam_group_policy_attachment.admin_readonly: Refreshing state... [id=forge-admin-readonly-20260311020030367100000001]
module.iam[0].module.groups.module.login_profile.data.aws_iam_policy_document.login_profile: Read complete after 0s [id=3718434498]
module.iam[0].module.groups.module.require_mfa.data.aws_iam_policy_document.require_mfa: Read complete after 0s [id=3095519315]
module.platform.module.assets.aws_s3_bucket_versioning.assets: Refreshing state... [id=forge-cms-prod-assets]
module.platform.module.assets.aws_s3_bucket_server_side_encryption_configuration.assets: Refreshing state... [id=forge-cms-prod-assets]
module.platform.module.assets.aws_s3_bucket_public_access_block.assets: Refreshing state... [id=forge-cms-prod-assets]
module.platform.module.assets.aws_s3_bucket_cors_configuration.assets: Refreshing state... [id=forge-cms-prod-assets]
module.platform.aws_s3_bucket_server_side_encryption_configuration.alb_logs: Refreshing state... [id=forge-platform-prod-alb-logs]
module.platform.aws_s3_bucket_lifecycle_configuration.alb_logs: Refreshing state... [id=forge-platform-prod-alb-logs]
module.platform.aws_s3_bucket_public_access_block.alb_logs: Refreshing state... [id=forge-platform-prod-alb-logs]
module.platform.data.aws_iam_policy_document.alb_logs: Reading...
module.platform.data.aws_iam_policy_document.alb_logs: Read complete after 0s [id=2401369402]
module.platform.aws_s3_bucket_versioning.alb_logs: Refreshing state... [id=forge-platform-prod-alb-logs]
module.platform.module.application.aws_iam_role_policy_attachment.ecs_execution: Refreshing state... [id=forge-cms-prod-execution-role/arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy]
module.platform.module.application.aws_kms_alias.cms_ssm: Refreshing state... [id=alias/forge-cms-prod-ssm]
module.platform.module.application.aws_ssm_parameter.app_keys: Refreshing state... [id=/forge/aws/cms/prod/APP_KEYS]
module.platform.module.application.aws_ssm_parameter.admin_jwt_secret: Refreshing state... [id=/forge/aws/cms/prod/ADMIN_JWT_SECRET]
module.platform.module.application.ephemeral.random_password.dev_jwt_secret: Closing...
module.platform.module.application.ephemeral.random_password.dev_jwt_secret: Closing complete after 0s
module.platform.module.application.aws_ssm_parameter.strapi_internal_api_token: Refreshing state... [id=/forge/aws/cms/prod/STRAPI_INTERNAL_API_TOKEN]
module.platform.module.application.aws_ssm_parameter.encryption_key: Refreshing state... [id=/forge/aws/cms/prod/ENCRYPTION_KEY]
module.platform.module.application.ephemeral.random_password.dev_api_token_salt: Closing...
module.platform.module.application.ephemeral.random_password.dev_api_token_salt: Closing complete after 0s
module.platform.module.application.ephemeral.random_password.dev_transfer_token_salt: Closing...
module.platform.module.application.ephemeral.random_password.dev_transfer_token_salt: Closing complete after 0s
module.platform.module.application.aws_ssm_parameter.api_token_salt: Refreshing state... [id=/forge/aws/cms/prod/API_TOKEN_SALT]
module.platform.module.application.aws_ssm_parameter.jwt_secret: Refreshing state... [id=/forge/aws/cms/prod/JWT_SECRET]
module.platform.module.application.ephemeral.random_password.dev_app_key_1: Closing...
module.platform.module.application.ephemeral.random_password.dev_app_key_1: Closing complete after 0s
module.platform.module.application.ephemeral.random_password.dev_app_key_4: Closing...
module.platform.module.application.ephemeral.random_password.dev_app_key_4: Closing complete after 0s
module.platform.module.application.ephemeral.random_password.dev_app_key_2: Closing...
module.platform.module.application.ephemeral.random_password.dev_app_key_2: Closing complete after 0s
module.platform.module.application.ephemeral.random_password.dev_app_key_3: Closing...
module.platform.module.application.ephemeral.random_password.dev_app_key_3: Closing complete after 0s
module.platform.module.application.ephemeral.random_password.dev_encryption_key: Closing...
module.platform.module.application.ephemeral.random_password.dev_encryption_key: Closing complete after 0s
module.platform.module.application.aws_ssm_parameter.transfer_token_salt: Refreshing state... [id=/forge/aws/cms/prod/TRANSFER_TOKEN_SALT]
module.platform.module.application.ephemeral.random_password.dev_admin_jwt_secret: Closing...
module.platform.module.application.ephemeral.random_password.dev_admin_jwt_secret: Closing complete after 0s
module.github.aws_iam_role.github_actions_cms_deploy: Refreshing state... [id=forge-github-actions-cms-deploy-prod]
module.github.aws_iam_role.github_actions_terraform_apply: Refreshing state... [id=forge-github-actions-terraform-apply-prod]
module.github.aws_iam_role.github_actions_terraform_plan: Refreshing state... [id=forge-github-actions-terraform-plan-prod]
module.platform.aws_security_group.ecs_service: Refreshing state... [id=sg-060df6d60e5a60ea3]
module.platform.aws_internet_gateway.platform: Refreshing state... [id=igw-0b5613d3e238c8997]
module.platform.aws_subnet.private[0]: Refreshing state... [id=subnet-0f53ac64bf2e3b394]
module.platform.aws_subnet.private[1]: Refreshing state... [id=subnet-05a263f448b51eb44]
module.platform.aws_security_group.alb: Refreshing state... [id=sg-03e6315b5f8558f5b]
module.platform.aws_subnet.public[1]: Refreshing state... [id=subnet-097840dc648bae953]
module.platform.aws_subnet.public[0]: Refreshing state... [id=subnet-00c2e931133e9a9a3]
module.iam[0].module.groups.module.dev_secrets.aws_iam_group_policy.dev_secrets: Refreshing state... [id=forge-dev-secrets:forge-dev-secrets]
module.iam[0].module.groups.module.login_profile.aws_iam_group_policy.login_profile: Refreshing state... [id=forge-iam-login-profile:forge-iam-login-profile]
module.iam[0].module.groups.module.require_mfa.aws_iam_policy.require_mfa: Refreshing state... [id=arn:aws:iam::031374266475:policy/forge-require-mfa]
module.platform.aws_s3_bucket_policy.alb_logs: Refreshing state... [id=forge-platform-prod-alb-logs]
module.platform.module.assets.aws_s3_bucket_server_side_encryption_configuration.assets_access_logs: Refreshing state... [id=forge-cms-prod-assets-access-logs]
module.platform.module.assets.aws_s3_bucket_lifecycle_configuration.assets_access_logs: Refreshing state... [id=forge-cms-prod-assets-access-logs]
module.platform.module.assets.aws_s3_bucket_public_access_block.assets_access_logs: Refreshing state... [id=forge-cms-prod-assets-access-logs]
module.platform.module.assets.aws_s3_bucket_logging.assets: Refreshing state... [id=forge-cms-prod-assets]
module.platform.module.assets.data.aws_iam_policy_document.assets_access_logs: Reading...
module.platform.module.assets.data.aws_iam_policy_document.assets_access_logs: Read complete after 0s [id=1618467773]
module.github.aws_ssm_parameter.terraform_aws_role_apply_arn: Refreshing state... [id=/forge/github/terraform_aws_role_apply_prod_arn]
module.platform.module.application.aws_lb_target_group.cms: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:031374266475:targetgroup/forge-cms-prod-tg/f6258b44491c5cd4]
module.github.aws_iam_role_policy.github_actions_cms_deploy: Refreshing state... [id=forge-github-actions-cms-deploy-prod:cms-deploy]
module.github.aws_ssm_parameter.cms_deploy_role_arn: Refreshing state... [id=/forge/github/cms_deploy_role_arn_prod]
module.github.aws_iam_role_policy_attachment.github_actions_terraform_plan_readonly: Refreshing state... [id=forge-github-actions-terraform-plan-prod/arn:aws:iam::aws:policy/ReadOnlyAccess]
module.github.aws_ssm_parameter.terraform_aws_role_plan_arn: Refreshing state... [id=/forge/github/terraform_aws_role_plan_prod_arn]
module.platform.aws_security_group.rds: Refreshing state... [id=sg-0124150b9d256b226]
module.platform.aws_route_table.public: Refreshing state... [id=rtb-0532fcf2c00112598]
module.platform.module.application.data.aws_iam_policy_document.ecs_task: Reading...
module.platform.module.application.data.aws_iam_policy_document.ecs_task: Read complete after 0s [id=184648198]
module.github.aws_iam_role_policy_attachment.github_actions_terraform_apply: Refreshing state... [id=forge-github-actions-terraform-apply-prod/arn:aws:iam::031374266475:policy/forge-github-actions-terraform-apply]
module.platform.module.assets.aws_s3_bucket_policy.assets_access_logs: Refreshing state... [id=forge-cms-prod-assets-access-logs]
module.github.data.aws_iam_policy_document.github_actions_terraform_stack["github_apply"]: Reading...
module.github.data.aws_iam_policy_document.github_actions_terraform_stack["github_apply"]: Read complete after 0s [id=3585029014]
module.github.data.aws_iam_policy_document.github_actions_terraform_stack["github_plan"]: Reading...
module.github.data.aws_iam_policy_document.github_actions_terraform_stack["vercel_apply"]: Reading...
module.github.data.aws_iam_policy_document.github_actions_terraform_stack["github_plan"]: Read complete after 0s [id=2997719824]
module.github.data.aws_iam_policy_document.github_actions_terraform_stack["vercel_apply"]: Read complete after 0s [id=133335047]
module.github.data.aws_iam_policy_document.github_actions_terraform_stack["vercel_plan"]: Reading...
module.github.data.aws_iam_policy_document.github_actions_terraform_stack_assume["vercel_plan"]: Reading...
module.github.data.aws_iam_policy_document.github_actions_terraform_stack_assume["vercel_plan"]: Read complete after 0s [id=3112099037]
module.github.data.aws_iam_policy_document.github_actions_terraform_stack["vercel_plan"]: Read complete after 0s [id=187520536]
module.github.data.aws_iam_policy_document.github_actions_terraform_stack_assume["github_apply"]: Reading...
module.github.data.aws_iam_policy_document.github_actions_terraform_stack_assume["github_plan"]: Reading...
module.github.data.aws_iam_policy_document.github_actions_terraform_stack_assume["github_apply"]: Read complete after 0s [id=1597332144]
module.github.data.aws_iam_policy_document.github_actions_terraform_stack_assume["github_plan"]: Read complete after 0s [id=2311664580]
module.github.data.aws_iam_policy_document.github_actions_terraform_stack_assume["vercel_apply"]: Reading...
module.github.data.aws_iam_policy_document.github_actions_terraform_stack_assume["vercel_apply"]: Read complete after 0s [id=2944720027]
module.platform.module.assets.aws_route53_record.assets_cert_validation["assets.forge.jesusfilm.org"]: Refreshing state... [id=Z078031724OHPW03IKVLO__5438fc20314ef99d95985128ac6c17b1.assets.forge.jesusfilm.org._CNAME]
module.platform.module.application.aws_route53_record.alb_cert_validation["cms.forge.jesusfilm.org"]: Refreshing state... [id=Z078031724OHPW03IKVLO__4e8973315cfba989c3fb2410ab13b8d9.cms.forge.jesusfilm.org._CNAME]
module.platform.aws_nat_gateway.platform: Refreshing state... [id=nat-0d016d28e5aab58a2]
module.platform.aws_lb.platform: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:031374266475:loadbalancer/app/forge-platform-prod-alb/32e2a7795932386a]
module.platform.module.application.aws_db_subnet_group.cms: Refreshing state... [id=forge-cms-prod-db-subnets]
module.platform.module.application.aws_vpc_security_group_ingress_rule.cms_from_alb: Refreshing state... [id=sgr-001c90b1521a7d334]
module.platform.module.application.aws_vpc_security_group_egress_rule.alb_to_cms: Refreshing state... [id=sgr-0d333a84f55e67028]
module.platform.module.application.aws_iam_role_policy.ecs_task: Refreshing state... [id=forge-cms-prod-task-role:forge-cms-prod-task-policy]
module.platform.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0235d4b16f74bbb86]
module.platform.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-072c541cb48d831ae]
module.github.data.aws_iam_policy_document.github_actions_terraform_plan_ssm_kms: Reading...
module.github.data.aws_iam_policy_document.github_actions_terraform_plan_ssm_kms: Read complete after 0s [id=551673509]
module.github.aws_iam_role.github_actions_terraform_stack["vercel_apply"]: Refreshing state... [id=forge-github-actions-terraform-vercel-apply]
module.github.aws_iam_role.github_actions_terraform_stack["vercel_plan"]: Refreshing state... [id=forge-github-actions-terraform-vercel-plan]
module.github.aws_iam_role.github_actions_terraform_stack["github_apply"]: Refreshing state... [id=forge-github-actions-terraform-github-apply]
module.github.aws_iam_role.github_actions_terraform_stack["github_plan"]: Refreshing state... [id=forge-github-actions-terraform-github-plan]
module.platform.aws_route_table.private: Refreshing state... [id=rtb-04444ffb223712e53]
module.platform.module.assets.aws_acm_certificate_validation.assets: Refreshing state... [id=2026-03-05 09:00:43.975 +0000 UTC]
module.platform.module.application.aws_acm_certificate_validation.alb: Refreshing state... [id=2026-03-05 09:00:41.575 +0000 UTC]
module.platform.aws_wafv2_web_acl_logging_configuration.alb: Refreshing state... [id=arn:aws:wafv2:us-east-2:031374266475:regional/webacl/forge-platform-prod-waf/5d527a2d-be37-446e-b4ed-53dd11c94e8a]
module.platform.aws_lb_listener.http_redirect: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:031374266475:listener/app/forge-platform-prod-alb/32e2a7795932386a/097d0c48c307920f]
module.platform.aws_wafv2_web_acl_association.alb: Refreshing state... [id=arn:aws:wafv2:us-east-2:031374266475:regional/webacl/forge-platform-prod-waf/5d527a2d-be37-446e-b4ed-53dd11c94e8a,arn:aws:elasticloadbalancing:us-east-2:031374266475:loadbalancer/app/forge-platform-prod-alb/32e2a7795932386a]
module.github.aws_iam_role_policy.github_actions_terraform_plan_ssm_kms: Refreshing state... [id=forge-github-actions-terraform-plan-prod:terraform-plan-ssm-kms]
module.platform.module.application.aws_db_instance.cms: Refreshing state... [id=db-DB2WTGAYSHKO5PXR2A3GNESLSY]
module.iam[0].module.groups.module.billing.aws_iam_group_policy_attachment.require_mfa: Refreshing state... [id=forge-billing-20260311020030417000000002]
module.iam[0].module.groups.module.admin_readonly.aws_iam_group_policy_attachment.require_mfa: Refreshing state... [id=forge-admin-readonly-20260311020030472400000004]
module.iam[0].module.groups.module.dev_secrets.aws_iam_group_policy_attachment.require_mfa: Refreshing state... [id=forge-dev-secrets-20260311020030460500000003]
module.iam[0].module.groups.module.login_profile.aws_iam_group_policy_attachment.require_mfa: Refreshing state... [id=forge-iam-login-profile-20260311020030486200000005]
module.platform.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0693204bbb9be4eca]
module.platform.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0706f67fd1ea051f9]
module.platform.module.application.aws_route53_record.alb_alias: Refreshing state... [id=Z078031724OHPW03IKVLO_cms.forge.jesusfilm.org_A]
module.platform.module.assets.aws_cloudfront_distribution.assets: Refreshing state... [id=E19IGKDD5ZI6JV]
module.github.aws_ssm_parameter.terraform_github_role_apply_arn[0]: Refreshing state... [id=/forge/github/terraform_github_role_apply_arn]
module.github.aws_ssm_parameter.terraform_github_role_plan_arn[0]: Refreshing state... [id=/forge/github/terraform_github_role_plan_arn]
module.github.aws_iam_role_policy.github_actions_terraform_stack["github_plan"]: Refreshing state... [id=forge-github-actions-terraform-github-plan:terraform-github_plan-access]
module.github.aws_iam_role_policy.github_actions_terraform_stack["vercel_apply"]: Refreshing state... [id=forge-github-actions-terraform-vercel-apply:terraform-vercel_apply-access]
module.github.aws_iam_role_policy.github_actions_terraform_stack["vercel_plan"]: Refreshing state... [id=forge-github-actions-terraform-vercel-plan:terraform-vercel_plan-access]
module.github.aws_iam_role_policy.github_actions_terraform_stack["github_apply"]: Refreshing state... [id=forge-github-actions-terraform-github-apply:terraform-github_apply-access]
module.github.aws_ssm_parameter.terraform_vercel_role_plan_arn[0]: Refreshing state... [id=/forge/github/terraform_vercel_role_plan_arn]
module.github.aws_ssm_parameter.terraform_vercel_role_apply_arn[0]: Refreshing state... [id=/forge/github/terraform_vercel_role_apply_arn]
module.platform.aws_lb_listener.https: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:031374266475:listener/app/forge-platform-prod-alb/32e2a7795932386a/7cad837f4c43d1d4]
module.iam[0].module.users.module.tataihono.data.aws_iam_group.login_profile: Reading...
module.iam[0].module.users.module.tataihono.data.aws_iam_group.billing: Reading...
module.iam[0].module.users.module.tataihono.data.aws_iam_group.admin_readonly: Reading...
module.platform.module.assets.aws_route53_record.assets_alias: Refreshing state... [id=Z078031724OHPW03IKVLO_assets.forge.jesusfilm.org_A]
module.iam[0].module.users.module.tataihono.data.aws_iam_group.login_profile: Read complete after 0s [id=AGPAQOTQNKBVQFQGB7HM5]
module.platform.module.assets.data.aws_iam_policy_document.assets_bucket: Reading...
module.platform.module.assets.data.aws_iam_policy_document.assets_bucket: Read complete after 0s [id=2853188073]
module.iam[0].module.users.module.tataihono.aws_iam_user.user: Refreshing state... [id=tataihono.nikora@jesusfilm.org]
module.iam[0].module.users.module.tataihono.data.aws_iam_group.billing: Read complete after 0s [id=AGPAQOTQNKBVURSDNG7FR]
module.iam[0].module.users.module.dev_secrets.aws_iam_user.dev_secrets["tataihono"]: Refreshing state... [id=tataihono-dev-secrets]
module.iam[0].module.users.module.tataihono.data.aws_iam_group.admin_readonly: Read complete after 0s [id=AGPAQOTQNKBVX7ZG7L3DH]
module.iam[0].module.users.module.dev_secrets.aws_iam_user.dev_secrets["up-tandem"]: Refreshing state... [id=up-tandem-dev-secrets]
module.iam[0].module.users.module.dev_secrets.aws_iam_user.dev_secrets["ur-imazing"]: Refreshing state... [id=ur-imazing-dev-secrets]
module.iam[0].module.users.module.dev_secrets.aws_iam_user.dev_secrets["kneesal"]: Refreshing state... [id=kneesal-dev-secrets]
module.platform.module.assets.aws_s3_bucket_policy.assets: Refreshing state... [id=forge-cms-prod-assets]
module.iam[0].module.users.module.tataihono.aws_iam_user_group_membership.admin: Refreshing state... [id=terraform-2026031102003106690000000a]
module.platform.module.application.aws_lb_listener_rule.cms_host: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:031374266475:listener-rule/app/forge-platform-prod-alb/32e2a7795932386a/7cad837f4c43d1d4/7a6a0551cd1a52d7]
module.iam[0].module.users.module.dev_secrets.aws_iam_user_group_membership.dev_secrets["tataihono"]: Refreshing state... [id=terraform-20260311020030984200000006]
module.iam[0].module.users.module.dev_secrets.aws_iam_user_group_membership.dev_secrets["ur-imazing"]: Refreshing state... [id=terraform-20260311020030996200000007]
module.iam[0].module.users.module.dev_secrets.aws_iam_user_group_membership.dev_secrets["kneesal"]: Refreshing state... [id=terraform-20260311020030997100000008]
module.iam[0].module.users.module.dev_secrets.aws_iam_user_group_membership.dev_secrets["up-tandem"]: Refreshing state... [id=terraform-20260311020031002400000009]
module.platform.module.application.data.aws_iam_policy_document.ecs_execution_secrets: Reading...
module.platform.module.application.aws_ecs_task_definition.cms: Refreshing state... [id=forge-cms-prod-task]
module.platform.module.application.data.aws_iam_policy_document.ecs_execution_secrets: Read complete after 0s [id=2105038920]
module.platform.module.application.aws_iam_role_policy.ecs_execution_secrets: Refreshing state... [id=forge-cms-prod-execution-role:forge-cms-prod-execution-secrets]
module.platform.module.application.aws_ecs_service.cms: Refreshing state... [id=arn:aws:ecs:us-east-2:031374266475:service/forge-cms-prod/forge-cms-prod-service]
module.platform.module.application.aws_appautoscaling_target.cms[0]: Refreshing state... [id=service/forge-cms-prod/forge-cms-prod-service]
module.platform.module.application.aws_appautoscaling_policy.cms_cpu[0]: Refreshing state... [id=forge-cms-prod-cpu]
module.platform.module.application.ephemeral.random_password.api_token_salt: Closing...
module.platform.module.application.ephemeral.random_password.encryption_key: Closing...
module.platform.module.application.ephemeral.random_password.admin_jwt_secret: Closing...
module.platform.module.application.ephemeral.random_password.app_key_3: Closing...
module.platform.module.application.ephemeral.random_password.app_key_2: Closing...
module.platform.module.application.ephemeral.random_password.jwt_secret: Closing...
module.platform.module.application.ephemeral.random_password.app_key_4: Closing...
module.platform.module.application.ephemeral.random_password.strapi_internal_api_token: Closing...
module.platform.module.application.ephemeral.random_password.transfer_token_salt: Closing...
module.platform.module.application.ephemeral.random_password.app_key_1: Closing...
module.platform.module.application.ephemeral.random_password.api_token_salt: Closing complete after 0s
module.platform.module.application.ephemeral.random_password.app_key_2: Closing complete after 0s
module.platform.module.application.ephemeral.random_password.admin_jwt_secret: Closing complete after 0s
module.platform.module.application.ephemeral.random_password.encryption_key: Closing complete after 0s
module.platform.module.application.ephemeral.random_password.app_key_3: Closing complete after 0s
module.platform.module.application.ephemeral.random_password.strapi_internal_api_token: Closing complete after 0s
module.platform.module.application.ephemeral.random_password.transfer_token_salt: Closing complete after 0s
module.platform.module.application.ephemeral.random_password.jwt_secret: Closing complete after 0s
module.platform.module.application.ephemeral.random_password.app_key_1: Closing complete after 0s
module.platform.module.application.ephemeral.random_password.app_key_4: Closing complete after 0s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.platform.module.application.aws_ecs_service.cms will be updated in-place
  ~ resource "aws_ecs_service" "cms" {
        id                                 = "arn:aws:ecs:us-east-2:031374266475:service/forge-cms-prod/forge-cms-prod-service"
        name                               = "forge-cms-prod-service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-east-2:031374266475:task-definition/forge-cms-prod-task:13" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.platform.module.application.aws_ecs_task_definition.cms must be replaced
-/+ resource "aws_ecs_task_definition" "cms" {
      ~ arn                      = "arn:aws:ecs:us-east-2:031374266475:task-definition/forge-cms-prod-task:13" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-2:031374266475:task-definition/forge-cms-prod-task" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "forge-cms-prod-task" -> (known after apply)
      ~ revision                 = 13 -> (known after apply)
        tags                     = {
            "Environment" = "prod"
            "ManagedBy"   = "terraform"
            "Service"     = "cms"
        }
        # (13 unchanged attributes hidden)
    }

  # module.platform.module.application.aws_iam_role_policy.ecs_task will be updated in-place
  ~ resource "aws_iam_role_policy" "ecs_task" {
        id          = "forge-cms-prod-task-role:forge-cms-prod-task-policy"
        name        = "forge-cms-prod-task-policy"
      ~ policy      = jsonencode(
          ~ {
              ~ Statement = [
                    # (2 unchanged elements hidden)
                    {
                        Action   = [
                            "kms:GenerateDataKey",
                            "kms:Decrypt",
                        ]
                        Effect   = "Allow"
                        Resource = "arn:aws:kms:us-east-2:031374266475:key/52863204-2209-4678-9c47-151c5cdf08d6"
                        Sid      = "KmsAssetsKeyUse"
                    },
                  + {
                      + Action   = [
                          + "ses:SendRawEmail",
                          + "ses:SendEmail",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "SesSendEmail"
                    },
                    {
                        Action   = [
                            "ssmmessages:OpenDataChannel",
                            "ssmmessages:OpenControlChannel",
                            "ssmmessages:CreateDataChannel",
                            "ssmmessages:CreateControlChannel",
                        ]
                        Effect   = "Allow"
                        Resource = "*"
                        Sid      = "EcsExec"
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (2 unchanged attributes hidden)
    }

  # module.platform.module.application.aws_route53_record.ses_dkim[0] will be created
  + resource "aws_route53_record" "ses_dkim" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 600
      + type            = "CNAME"
      + zone_id         = "Z078031724OHPW03IKVLO"
    }

  # module.platform.module.application.aws_route53_record.ses_dkim[1] will be created
  + resource "aws_route53_record" "ses_dkim" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 600
      + type            = "CNAME"
      + zone_id         = "Z078031724OHPW03IKVLO"
    }

  # module.platform.module.application.aws_route53_record.ses_dkim[2] will be created
  + resource "aws_route53_record" "ses_dkim" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 600
      + type            = "CNAME"
      + zone_id         = "Z078031724OHPW03IKVLO"
    }

  # module.platform.module.application.aws_route53_record.ses_mail_from_mx[0] will be created
  + resource "aws_route53_record" "ses_mail_from_mx" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "mail.forge.jesusfilm.org"
      + records         = [
          + "10 feedback-smtp.us-east-2.amazonses.com",
        ]
      + ttl             = 600
      + type            = "MX"
      + zone_id         = "Z078031724OHPW03IKVLO"
    }

  # module.platform.module.application.aws_route53_record.ses_mail_from_spf[0] will be created
  + resource "aws_route53_record" "ses_mail_from_spf" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "mail.forge.jesusfilm.org"
      + records         = [
          + "v=spf1 include:amazonses.com -all",
        ]
      + ttl             = 600
      + type            = "TXT"
      + zone_id         = "Z078031724OHPW03IKVLO"
    }

  # module.platform.module.application.aws_ses_domain_dkim.forge[0] will be created
  + resource "aws_ses_domain_dkim" "forge" {
      + dkim_tokens = (known after apply)
      + domain      = "forge.jesusfilm.org"
      + id          = (known after apply)
      + region      = "us-east-2"
    }

  # module.platform.module.application.aws_ses_domain_identity.forge[0] will be created
  + resource "aws_ses_domain_identity" "forge" {
      + arn                = (known after apply)
      + domain             = "forge.jesusfilm.org"
      + id                 = (known after apply)
      + region             = "us-east-2"
      + verification_token = (known after apply)
    }

  # module.platform.module.application.aws_ses_domain_mail_from.forge[0] will be created
  + resource "aws_ses_domain_mail_from" "forge" {
      + behavior_on_mx_failure = "UseDefaultValue"
      + domain                 = "forge.jesusfilm.org"
      + id                     = (known after apply)
      + mail_from_domain       = "mail.forge.jesusfilm.org"
      + region                 = "us-east-2"
    }

Plan: 9 to add, 2 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```